


6man Working Group                                           S. Krishnan
Internet-Draft                                               A. Kavanagh
Intended status: Standards Track                                Ericsson
Expires: May 7, 2009                                    November 3, 2008


        Line identification in IPv6 Router Solicitation messages
                     draft-krishnan-6man-rs-mark-01

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on May 7, 2009.


















Krishnan & Kavanagh        Expires May 7, 2009                  [Page 1]

Internet-Draft          Line Identification in RS          November 2008


Abstract

   In ethernet based aggregation networks, several subscriber premises
   may be connected to the same interface of an edge router.  This
   document proposes a method for the edge router to identify the
   subscriber premises using the contents of the received router
   solicitation messages.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
     1.1.  Conventions used in this document  . . . . . . . . . . . .  3
   2.  Access Node Behavior . . . . . . . . . . . . . . . . . . . . .  4
     2.1.  On receiving a router solicitation from the subscriber . .  4
     2.2.  On receiving a router advertisement from the edge
           router . . . . . . . . . . . . . . . . . . . . . . . . . .  4
   3.  Edge Router Behavior . . . . . . . . . . . . . . . . . . . . .  5
     3.1.  On receiving a router solicitation from the subscriber . .  5
     3.2.  On sending a router advertisement towards the
           subscriber . . . . . . . . . . . . . . . . . . . . . . . .  5
   4.  Line Identification Neighbor Discovery Option  . . . . . . . .  6
   5.  Security Considerations  . . . . . . . . . . . . . . . . . . .  7
   6.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . .  8
   7.  Normative References . . . . . . . . . . . . . . . . . . . . .  9
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 10
   Intellectual Property and Copyright Statements . . . . . . . . . . 11
























Krishnan & Kavanagh        Expires May 7, 2009                  [Page 2]

Internet-Draft          Line Identification in RS          November 2008


1.  Introduction

   In a fixed Broadband Network, IPv6 hosts are connected to an Access
   Node (AN).  These hosts today will typically send a Route
   Solicitation Message to the Edge Router, to which the Edge Router
   responds with a Router Advertisement message.  The router
   advertisement typically contains a prefix that the host will use to
   automatically configure an IPv6 Address.  Upon sending the Route
   Solicitation message the node connecting the host on the access
   circuit, typically an Access Node (AN), would forward the RS to the
   Edge Router upstream over a switched network.  However, in such
   ethernet based aggregation networks, several subscriber premises may
   be connected to the same interface of an edge router (e.g. on the
   same VLAN).  However, the edge router requires some information to
   identify the host on the circuit line the host is connected on.  To
   accomplish this, the AN needs to add line identification information
   to the Route Solicitation message and forward this to the Edge
   Router.  This document proposes a method for the edge router to
   identify the subscriber premises using the contents of the received
   router solicitation messages.

1.1.  Conventions used in this document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL","SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

























Krishnan & Kavanagh        Expires May 7, 2009                  [Page 3]

Internet-Draft          Line Identification in RS          November 2008


2.  Access Node Behavior

2.1.  On receiving a router solicitation from the subscriber

   When a host sends out a router solicitation, it is received by the
   access node.  First, the access node needs to verify if there are no
   LIO options present in the router solicitation.  If there are any LIO
   options present, the AN MUST drop the router solicitation.  If there
   are no LIO options present, the AN SHOULD insert a new LIO option
   into the router solicitation message.  The AN MUST set the line
   identification data of the LIO option to contain the subscriber agent
   circuit identifier corresponding to the logical access loop port of
   the Access Node from which the RS was initiated.

2.2.  On receiving a router advertisement from the edge router

   When the edge router sends out a router advertisement in response to
   the RS, it is received by the access node.  If there is an LIO option
   present, the AN MUST use the line identification data of the LIO
   option to identify the subscriber agent circuit identifier
   corresponding to the logical access loop port of the Access Node on
   which the RA should be sent.





























Krishnan & Kavanagh        Expires May 7, 2009                  [Page 4]

Internet-Draft          Line Identification in RS          November 2008


3.  Edge Router Behavior

3.1.  On receiving a router solicitation from the subscriber

   When the edge router receives a router solicitation forwarded by the
   access node, it needs to check if there is an LIO option present in
   the router solicitation.  If an LIO option is present, the edge
   router MAY use the contents of the line identification field to
   lookup the addressing information and policy that need to be applied
   to the subscriber.

3.2.  On sending a router advertisement towards the subscriber

   When the edge router sends out a router advertisement in response to
   an RS that contained an LIO option, it MUST insert an LIO option in
   the RA.  The line identification data field of the LIO option MUST be
   set to the same value as was received in the LIO option of the RS.


































Krishnan & Kavanagh        Expires May 7, 2009                  [Page 5]

Internet-Draft          Line Identification in RS          November 2008


4.  Line Identification Neighbor Discovery Option

   The Line Identification Option (LIO) can be included in Router
   Solicitation and Router Advertisement messages.  Multiple Line
   Identification options MUST NOT be present in a Neighbor Discovery
   message.  The LIO has an alignment requirement of 4n.

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |   Length      |           Reserved            |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                     Line Identification...
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


    Type

       8-bit identifier of the type of option. The option identifier
       for the line identification option will be allocated by the IANA.

    Length

       8-bit unsigned integer.  The length of the option (including
       the type and length fields) in units of 8 octets.  The value
       0 is considered invalid.

    Line Identification

       In a Router Solicitation:

       Variable length data inserted by the Access Node describing the
       subscriber agent circuit identifier corresponding to the logical
       access loop port of the Access Node from which the RS was
       initiated.

       In a Router Advertisement:

       Variable length data inserted by the Edge Router describing the
       subscriber agent circuit identifier corresponding to the logical
       access loop port of the Access Node on which the RA needs to be
       sent out.

                Figure 1: Line Identification Option Layout







Krishnan & Kavanagh        Expires May 7, 2009                  [Page 6]

Internet-Draft          Line Identification in RS          November 2008


5.  Security Considerations

   The line identification information inserted by the access node or
   the edge router is not protected.  This means that this option may be
   modifed, inserted, or deleted without being detected.  In order to
   ensure validity of the contents of the line identification field, the
   network between the access node and the edge router needs to be
   trusted.











































Krishnan & Kavanagh        Expires May 7, 2009                  [Page 7]

Internet-Draft          Line Identification in RS          November 2008


6.  IANA Considerations

   This document defines a new IPv6 neighbor discovery option for
   carrying line identification.  IANA is requested to assign the a new
   neighbor discovery option type in the registry maintained at

   http://www.iana.org/assignments/icmpv6-parameters

   <TBA> Line Identification Option [RFCXXXX]










































Krishnan & Kavanagh        Expires May 7, 2009                  [Page 8]

Internet-Draft          Line Identification in RS          November 2008


7.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.















































Krishnan & Kavanagh        Expires May 7, 2009                  [Page 9]

Internet-Draft          Line Identification in RS          November 2008


Authors' Addresses

   Suresh Krishnan
   Ericsson
   8400 Blvd Decarie
   Town of Mount Royal, Quebec
   Canada

   Email: suresh.krishnan@ericsson.com


   Alan Kavanagh
   Ericsson
   8400 Blvd Decarie
   Town of Mount Royal, Quebec
   Canada

   Email: alan.kavanagh@ericsson.com

































Krishnan & Kavanagh        Expires May 7, 2009                 [Page 10]

Internet-Draft          Line Identification in RS          November 2008


Full Copyright Statement

   Copyright (C) The IETF Trust (2008).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.











Krishnan & Kavanagh        Expires May 7, 2009                 [Page 11]

